Revit 2026 API

# ControlledApplicationAllUsersAddinsLocation Property

---

Add-ins location for all users.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AllUsersAddinsLocation { get; }
```
```vb
Public ReadOnly Property AllUsersAddinsLocation As String
	Get
```
```cpp
public:
property String^ AllUsersAddinsLocation {
	String^ get ();
}
```
```fsharp
member AllUsersAddinsLocation : string with get
```

#### Property Value

String

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace